status/src/2022/0204.org
#+TITLE: 29 January 2022 - 04 February 2022

Settled into the new year

* MIT OCW
** 18.02 - Multiple Variable Calculus
*** Sessions 17-19, PS3
** 8.01X+8.01L - Physics I - Classical Mechanics with Labs
*** Still in U/P Chapter 5 reading.
*** Started Experiment ES
** 21G.701 Spanish
*** Finished Episode 7
* CGR-101
** String handling
** INCLUDE processing (WIP)
   Need to push input FD and EOL processing into parser/grammar.
** Pushed kicking and screaming to github
   https://github.com/daniel-kelley/cgr101-scpi
* Mill Controller #2
  Potential for using old Compaq iPaq boards.
* Quilting Frame Desk
** Materials identified
** Rough Design
* David Davies
** Broadcom BCG? Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Next hearing 4/5/2022.
* Peter Kim
** Broadcom CSG Employee indicted for trade secret theft.
** United States v. Kim (5:21-cr-00438).
** Next hearing: 3/8/2022
* Books
  Light in the Darkness: Black Holes, the Universe, and Us by Heino Falcke
