status/2022/0204.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-05 Sat 05:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>29 January 2022 - 04 February 2022</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Kelley" />
</head>
<body>
<div id="content">
<h1 class="title">29 January 2022 - 04 February 2022</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org086f2ee">1. MIT OCW</a>
<ul>
<li><a href="#org3d6737c">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org2a7f5f7">1.1.1. Sessions 17-19, PS3</a></li>
</ul>
</li>
<li><a href="#orgaed683d">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#org90117b5">1.2.1. Still in U/P Chapter 5 reading.</a></li>
<li><a href="#orge94f045">1.2.2. Started Experiment ES</a></li>
</ul>
</li>
<li><a href="#org7a55ebd">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#org64fe1b5">1.3.1. Finished Episode 7</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb04df02">2. CGR-101</a>
<ul>
<li><a href="#org034c135">2.1. String handling</a></li>
<li><a href="#orgb7664e7">2.2. INCLUDE processing (WIP)</a></li>
<li><a href="#orgb0d8f5e">2.3. Pushed kicking and screaming to github</a></li>
</ul>
</li>
<li><a href="#orgd155372">3. Mill Controller #2</a></li>
<li><a href="#orge338352">4. Quilting Frame Desk</a>
<ul>
<li><a href="#orgaec9422">4.1. Materials identified</a></li>
<li><a href="#org7200c2e">4.2. Rough Design</a></li>
</ul>
</li>
<li><a href="#orgf4cef0e">5. David Davies</a>
<ul>
<li><a href="#orgf31e0e8">5.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgf02f754">5.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org734f371">5.3. Next hearing 4/5/2022.</a></li>
</ul>
</li>
<li><a href="#orgb262578">6. Peter Kim</a>
<ul>
<li><a href="#org58b766a">6.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#orgcc8d3ab">6.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#orgaa8dd58">6.3. Next hearing: 3/8/2022</a></li>
</ul>
</li>
<li><a href="#orga55f46d">7. Books</a></li>
</ul>
</div>
</div>
<p>
Settled into the new year
</p>

<div id="outline-container-org086f2ee" class="outline-2">
<h2 id="org086f2ee"><span class="section-number-2">1</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3d6737c" class="outline-3">
<h3 id="org3d6737c"><span class="section-number-3">1.1</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2a7f5f7" class="outline-4">
<h4 id="org2a7f5f7"><span class="section-number-4">1.1.1</span> Sessions 17-19, PS3</h4>
</div>
</div>
<div id="outline-container-orgaed683d" class="outline-3">
<h3 id="orgaed683d"><span class="section-number-3">1.2</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org90117b5" class="outline-4">
<h4 id="org90117b5"><span class="section-number-4">1.2.1</span> Still in U/P Chapter 5 reading.</h4>
</div>
<div id="outline-container-orge94f045" class="outline-4">
<h4 id="orge94f045"><span class="section-number-4">1.2.2</span> Started Experiment ES</h4>
</div>
</div>
<div id="outline-container-org7a55ebd" class="outline-3">
<h3 id="org7a55ebd"><span class="section-number-3">1.3</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org64fe1b5" class="outline-4">
<h4 id="org64fe1b5"><span class="section-number-4">1.3.1</span> Finished Episode 7</h4>
</div>
</div>
</div>
<div id="outline-container-orgb04df02" class="outline-2">
<h2 id="orgb04df02"><span class="section-number-2">2</span> CGR-101</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org034c135" class="outline-3">
<h3 id="org034c135"><span class="section-number-3">2.1</span> String handling</h3>
</div>
<div id="outline-container-orgb7664e7" class="outline-3">
<h3 id="orgb7664e7"><span class="section-number-3">2.2</span> INCLUDE processing (WIP)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Need to push input FD and EOL processing into parser/grammar.
</p>
</div>
</div>
<div id="outline-container-orgb0d8f5e" class="outline-3">
<h3 id="orgb0d8f5e"><span class="section-number-3">2.3</span> Pushed kicking and screaming to github</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="https://github.com/daniel-kelley/cgr101-scpi">https://github.com/daniel-kelley/cgr101-scpi</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgd155372" class="outline-2">
<h2 id="orgd155372"><span class="section-number-2">3</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
<p>
Potential for using old Compaq iPaq boards.
</p>
</div>
</div>
<div id="outline-container-orge338352" class="outline-2">
<h2 id="orge338352"><span class="section-number-2">4</span> Quilting Frame Desk</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgaec9422" class="outline-3">
<h3 id="orgaec9422"><span class="section-number-3">4.1</span> Materials identified</h3>
</div>
<div id="outline-container-org7200c2e" class="outline-3">
<h3 id="org7200c2e"><span class="section-number-3">4.2</span> Rough Design</h3>
</div>
</div>
<div id="outline-container-orgf4cef0e" class="outline-2">
<h2 id="orgf4cef0e"><span class="section-number-2">5</span> David Davies</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgf31e0e8" class="outline-3">
<h3 id="orgf31e0e8"><span class="section-number-3">5.1</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgf02f754" class="outline-3">
<h3 id="orgf02f754"><span class="section-number-3">5.2</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org734f371" class="outline-3">
<h3 id="org734f371"><span class="section-number-3">5.3</span> Next hearing 4/5/2022.</h3>
</div>
</div>
<div id="outline-container-orgb262578" class="outline-2">
<h2 id="orgb262578"><span class="section-number-2">6</span> Peter Kim</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org58b766a" class="outline-3">
<h3 id="org58b766a"><span class="section-number-3">6.1</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-orgcc8d3ab" class="outline-3">
<h3 id="orgcc8d3ab"><span class="section-number-3">6.2</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-orgaa8dd58" class="outline-3">
<h3 id="orgaa8dd58"><span class="section-number-3">6.3</span> Next hearing: 3/8/2022</h3>
</div>
</div>
<div id="outline-container-orga55f46d" class="outline-2">
<h2 id="orga55f46d"><span class="section-number-2">7</span> Books</h2>
<div class="outline-text-2" id="text-7">
<p>
Light in the Darkness: Black Holes, the Universe, and Us by Heino Falcke
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-02-05 Sat 05:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
